
{
  "appTitle": "যাকাত ক্যালকুলেটর",
  "appDescription": "আপনার যাকাত বাধ্যবাধকতার জন্য একটি বুদ্ধিমান সহকারী।",
  "supportTitle": "এই প্রকল্পটি সমর্থন করুন",
  "supportDescription": "এই অ্যাপটি বিনামূল্যে, বিজ্ঞাপনমুক্ত এবং উম্মাহর জন্য নির্মিত।",
  "supportMessage": "একজন স্বতন্ত্র ডেভেলপার হিসেবে, আপনার সমর্থন সার্ভার খরচ বহন করতে সাহায্য করে এবং আমাকে আমাদের সম্প্রদায়ের জন্য এই সরঞ্জামটি উন্নত করতে দেয়। আপনার অবদান, যতই ছোট হোক না কেন, গভীরভাবে প্রশংসিত।",
  "donateButton": "আমাকে একটি কফি কিনে দিন",
  "supportNote": "আপনার সমর্থন এই প্রকল্পটি জীবিত এবং বিজ্ঞাপন-মুক্ত রাখতে সাহায্য করে।",
  "footerBuiltWithCare": "মুসলিম সম্প্রদায়ের জন্য যত্ন সহকারে নির্মিত।",
  "footerAllRightsReserved": "সর্বস্বত্ব সংরক্ষিত।",
  "calculator_title": "যাকাত ক্যালকুলেটর",
  "calculator_description": "আপনার যাকাত গণনা করার জন্য একটি সম্পদের ধরন এবং শর্তাবলী নির্বাচন করুন।",
  "asset_type_label": "সম্পদের ধরন",
  "asset_type_placeholder": "একটি সম্পদের ধরন নির্বাচন করুন",
  "asset_gold": "সোনা",
  "asset_silver": "রূপা",
  "asset_cash": "নগদ ও সঞ্চয়",
  "asset_investments": "বিনিয়োগ",
  "asset_business": "ব্যবসায়িক সম্পদ",
  "asset_livestock": "গবাদি পশু",
  "asset_agriculture": "কৃষি",
  "asset_rikaz": "রিকাজ (গুপ্তধন)",
  "livestock_type_label": "গবাদি পশুর ধরন",
  "livestock_type_placeholder": "গবাদি পশুর ধরন নির্বাচন করুন",
  "livestock_sheep_goats": "ভেড়া/ছাগল",
  "livestock_cattle": "গরু",
  "livestock_camels": "উট",
  "weight_in_grams_label": "গ্রামের ওজন",
  "number_of_animals_label": "পশুর সংখ্যা",
  "asset_value_in_currency_label": "{{currency}} মুদ্রায় সম্পদের মূল্য",
  "hawl_completed_label": "হাওল (বছর) পূর্ণ হয়েছে?",
  "hawl_description": "আপনি কি এই সম্পদ এক চান্দ্র বছর ধরে রেখেছেন?",
  "irrigation_method_label": "সেচ পদ্ধতি",
  "agri_rain_fed": "বৃষ্টি নির্ভর (১০%)",
  "agri_artificial": "কৃত্রিমভাবে সেচ (৫%)",
  "notes_label": "অতিরিক্ত নোট (ঐচ্ছিক)",
  "notes_placeholder_gold": "আপনার সোনার ওজন গ্রামে লিখুন।",
  "notes_placeholder_silver": "আপনার রূপার ওজন গ্রামে লিখুন।",
  "notes_placeholder_cash": "যেমন, ব্যাংক অ্যাকাউন্ট এবং হাতে থাকা মোট নগদ।",
  "notes_placeholder_investments": "যেমন, স্টক, মিউচুয়াল ফান্ড ইত্যাদির মূল্য।",
  "notes_placeholder_business": "যেমন, ইনভেন্টরির মূল্য + প্রাপ্য - স্বল্পমেয়াদী ঋণ।",
  "notes_placeholder_livestock": "মূল্য ক্ষেত্রে পশুর সংখ্যা লিখুন।",
  "notes_placeholder_agriculture": "আপনার ফসলের মোট মূল্য লিখুন।",
  "notes_placeholder_rikaz": "যেমন, আবিষ্কৃত প্রাচীন মুদ্রার মূল্য।",
  "notes_description": "জটিল পরিস্থিতির জন্য, দয়া করে বিস্তারিত প্রদান করুন।",
  "madhab_label": "মাযহাব",
  "madhab_placeholder": "একটি মাযহাব নির্বাচন করুন",
  "madhab_description": "দ্রষ্টব্য: মাযহাব নির্বাচন প্রধানত প্রশ্নোত্তর বিভাগের ফিকহি বিবরণকে প্রভাবিত করে। মূল গণনার নিয়মগুলি মানসম্মত।",
  "calculate_button": "যাকাত গণনা করুন",
  "market_prices_title": "মুদ্রা এবং বাজার দর",
  "market_prices_description": "সঠিক গণনার জন্য, আপনার মুদ্রা নির্বাচন করুন এবং সোনা/রূপার দাম বর্তমান বাজার দর প্রতিফলিত করতে আপডেট করুন। ডিফল্ট মানগুলি একটি অনুমান হিসাবে প্রদান করা হয়।",
  "currency_label": "মুদ্রা",
  "currency_placeholder": "মুদ্রা নির্বাচন করুন",
  "gold_price_label": "সোনার দাম / গ্রাম ({{currency}})",
  "silver_price_label": "রূপার দাম / গ্রাম ({{currency}})",
  "nisab_label": "নিসাব",
  "result_title": "আপনার যাকাতের দায়",
  "result_due_for": "{{asset}} এর জন্য যাকাত",
  "result_breakdown": "গণনার বিবরণ",
  "result_placeholder": "আপনার গণনার ফলাফল এখানে প্রদর্শিত হবে।",
  "export_pdf_button": "পিডিএফ রপ্তানি করুন",
  "share_button": "শেয়ার করুন",
  "calculator_disclaimer": "দাবিত্যাগ: এটি একটি শিক্ষামূলক সরঞ্জাম এবং ফতোয়া নয়। জটিল আর্থিক পরিস্থিতির জন্য দয়া করে একজন যোগ্য ইসলামী পণ্ডিতের সাথে পরামর্শ করুন।",
  "faq_title": "সচরাচর জিজ্ঞাস্য",
  "faq_q1": "যাকাত কি?",
  "faq_a1": "যাকাত একটি বাধ্যতামূলক দাতব্য অনুদান যা নির্দিষ্ট সম্পদ মানদণ্ড পূরণকারী মুসলমানদের জন্য। এটি ইসলামের পাঁচটি স্তম্ভের মধ্যে একটি এবং এটি একটি ইবাদত হিসাবে বিবেচিত হয়। 'যাকাত' শব্দের অর্থ 'শুদ্ধ করা', এবং বিশ্বাস করা হয় যে যাকাত প্রদান করলে সম্পদ শুদ্ধ হয়।",
  "faq_q2": "কে যাকাত দেয়?",
  "faq_a2": "যাকাত প্রাপ্তবয়স্ক, সুস্থ মস্তিষ্কের মুসলমানের জন্য বাধ্যতামূলক, যিনি একটি নির্দিষ্ট সীমার উপরে সম্পদের মালিক, যা নিসাব নামে পরিচিত, একটি পূর্ণ চান্দ্র বছরের জন্য (হাওল)। সম্পদ অবশ্যই উৎপাদনশীল বা বৃদ্ধির সম্ভাবনা থাকতে হবে।",
  "faq_q3": "নিসাব কি?",
  "faq_a3": "নিসাব হল সর্বনিম্ন পরিমাণ সম্পদ যা একজন মুসলমানের মালিকানাধীন থাকতে হবে যাকাত প্রদানের জন্য। এই সীমাটি ঐতিহ্যগতভাবে ৮৫ গ্রাম খাঁটি সোনা বা ৫৯৫ গ্রাম খাঁটি রূপার মূল্যের উপর নির্ধারিত হয়। সোনা এবং রূপার বাজার দরের উপর ভিত্তি করে নিসাবের মূল্য প্রতিদিন পরিবর্তিত হয়। আপনার যাকাত গণনা করার সময় আপনার একটি নির্ভরযোগ্য স্থানীয় উৎস থেকে বর্তমান দর পরীক্ষা করা উচিত।",
  "faq_q4": "যাকাতের প্রকারভেদ কি?",
  "faq_a4": "যাকাত প্রধানত দুটি প্রধান প্রকারে বিভক্ত: যাকাত আল-মাল (সম্পদের যাকাত) এবং যাকাত আল-ফিতর (রোজা ভাঙার যাকাত)।\\n\\n১. যাকাত আল-মাল (সম্পদের যাকাত)\\nএটি বার্ষিক যাকাত যা একজন ব্যক্তির সামগ্রিক সম্পদের উপর গণনা করা হয় যা একটি পূর্ণ চান্দ্র বছরের জন্য তার দখলে ছিল এবং নিসাব সীমার উপরে। যাকাত আল-মালের অধীন সম্পদের প্রকারভেদগুলির মধ্যে রয়েছে:\\n\\n* ব্যক্তিগত সম্পদ: সোনা, রূপা, বাড়িতে বা ব্যাংক অ্যাকাউন্টে নগদ টাকা, এবং স্টক।\\n* ব্যবসায়িক সম্পদ: ব্যবসায়িক পণ্য, ব্যবসায়িক ইনভেন্টরি, এবং লাভ।\\n* কৃষি পণ্য (উশর): ফসল এবং ফলনের উপর যাকাত। প্রাকৃতিকভাবে সেচ (বৃষ্টির মাধ্যমে) জমির জন্য হার সাধারণত ১০% এবং কৃত্রিম উপায়ে সেচ করা জমির জন্য ৫%।\\n* গবাদি পশু (আন'আম): উট, গরু, ভেড়া এবং ছাগলের মতো চারণকারী پশুর উপর যাকাত, প্রতিটি বিভাগের জন্য নির্দিষ্ট নিসাব সীমা এবং হার সহ।\\n* নিষ্কাশিত সম্পদ (রিকাজ): আবিষ্কৃত গুপ্তধন বা প্রাকৃতিক সম্পদের উপর যাকাত, সাধারণত ২০% হারে।\\n\\n২. যাকাত আল-ফিতর (ফিতরানা)\\nএটি একটি দাতব্য অনুদান যা প্রতিটি মুসলমান, নির্ভরশীল সহ, রমজানের শেষে ঈদ-উল-ফিতরের নামাজের আগে দিতে হবে। এটি একটি নির্দিষ্ট পরিমাণ (ঐতিহ্যগতভাবে একটি সা' - প্রায় ৩ কেজি) একটি প্রধান খাদ্য সামগ্রী যেমন খেজুর, যব, বা গম, বা তার আর্থিক সমতুল্য। এর উদ্দেশ্য হল যারা রোজা রেখেছে তাদের শুদ্ধ করা এবং গরীবরা যাতে ঈদ উদযাপন করতে পারে তা নিশ্চিত করা।",
  "faq_q5": "নির্ভরযোগ্য সুন্নি উৎস থেকে তথ্যসূত্র",
  "faq_a5": "যাকাতের বাধ্যবাধকতা কুরআন এবং নবী মুহাম্মদ (সাঃ) এর সুন্নাহে প্রতিষ্ঠিত।\\n\\nকুরআন: \\\"এবং নামায প্রতিষ্ঠা কর ও যাকাত দাও এবং যারা রুকু করে তাদের সাথে রুকু কর।\\\" (সূরা আল-বাকারা ২:৪৩)\\n\\nহাদিস: নবী মুহাম্মদ (সাঃ) বলেছেন, \\\"ইসলাম পাঁচটি স্তম্ভের উপর নির্মিত: সাক্ষ্য দেওয়া যে আল্লাহ ছাড়া কোন উপাস্য নেই এবং মুহাম্মদ আল্লাহর রাসূল, নামায প্রতিষ্ঠা করা, যাকাত দেওয়া, ঘরের হজ করা, এবং রমজানের রোজা রাখা।\\\" (সহীহ আল-বুখারী, সহীহ মুসলিম)",
  "chatbot_cta": "প্রশ্ন আছে? আমাদের AI কে জিজ্ঞাসা করুন!",
  "chatbot_sr_open": "যাকাত AI সহকারী খুলুন",
  "chatbot_title": "যাকাত AI সহকারী",
  "chatbot_description": "যাকাত সম্পর্কে যেকোনো প্রশ্ন জিজ্ঞাসা করুন এবং তাৎক্ষণিক উত্তর পান।",
  "chatbot_placeholder": "একটি প্রশ্ন জিজ্ঞাসা করুন যেমন: \\\"সোনার নিসাব কি؟\\\"",
  "chatbot_input_placeholder": "একটি প্রশ্ন জিজ্ঞাসা করুন...",
  "chatbot_sr_send": "প্রেরণ করুন"
}
