
{
  "appTitle": "ज़कात कैलकुलेटर",
  "appDescription": "आपकी ज़कात दायित्वों के लिए एक बुद्धिमान सहायक।",
  "supportTitle": "इस परियोजना का समर्थन करें",
  "supportDescription": "यह ऐप मुफ़्त, विज्ञापन-मुक्त है, और उम्मा के लिए बनाया गया है।",
  "supportMessage": "एक व्यक्तिगत डेवलपर के रूप में, आपका समर्थन सर्वर लागत को कवर करने में मदद करता है और मुझे हमारे समुदाय के लिए इस उपकरण में सुधार जारी रखने की अनुमति देता है। आपका योगदान, चाहे कितना भी छोटा क्यों न हो, बहुत सराहा जाता है।",
  "donateButton": "PayPal के साथ दान करें",
  "supportNote": "कृपया कोड में \"YOUR_PAYPAL_ID\" को अपनी वास्तविक PayPal बटन आईडी से बदलें।",
  "footerBuiltWithCare": "मुस्लिम समुदाय के लिए देखभाल के साथ बनाया गया।",
  "footerAllRightsReserved": "सर्वाधिकार सुरक्षित।",
  "calculator_title": "ज़कात कैलकुलेटर",
  "calculator_description": "अपनी ज़कात की गणना करने के लिए एक संपत्ति प्रकार और शर्तें चुनें।",
  "asset_type_label": "संपत्ति का प्रकार",
  "asset_type_placeholder": "एक संपत्ति प्रकार चुनें",
  "asset_gold": "सोना",
  "asset_silver": "चांदी",
  "asset_cash": "नकद और बचत",
  "asset_investments": "निवेश",
  "asset_business": "व्यापारिक संपत्ति",
  "asset_livestock": "पशुधन",
  "asset_agriculture": "कृषि",
  "asset_rikaz": "रिकाज़ (खजाना)",
  "livestock_type_label": "पशुधन का प्रकार",
  "livestock_type_placeholder": "पशुधन का प्रकार चुनें",
  "livestock_sheep_goats": "भेड़/बकरी",
  "livestock_cattle": "मवेशी",
  "livestock_camels": "ऊंट",
  "weight_in_grams_label": "ग्राम में वजन",
  "number_of_animals_label": "जानवरों की संख्या",
  "asset_value_in_currency_label": "{{currency}} में संपत्ति का मूल्य",
  "hawl_completed_label": "हौल (वर्ष) पूरा हो गया?",
  "hawl_description": "क्या आपने इस धन को एक चंद्र वर्ष तक अपने पास रखा है?",
  "irrigation_method_label": "सिंचाई की विधि",
  "agri_rain_fed": "वर्षा-सिंचित (10%)",
  "agri_artificial": "कृत्रिम रूप से सिंचित (5%)",
  "notes_label": "अतिरिक्त नोट्स (वैकल्पिक)",
  "notes_placeholder_gold": "अपने सोने का वजन ग्राम में दर्ज करें।",
  "notes_placeholder_silver": " अपनी चांदी का वजन ग्राम में दर्ज करें।",
  "notes_placeholder_cash": "उदा., बैंक खातों में कुल और हाथ में नकद।",
  "notes_placeholder_investments": "उदा., स्टॉक, म्यूचुअल फंड, आदि का मूल्य।",
  "notes_placeholder_business": "उदा., इन्वेंट्री का मूल्य + प्राप्य - अल्पकालिक ऋण।",
  "notes_placeholder_livestock": "मूल्य क्षेत्र में जानवरों की संख्या दर्ज करें।",
  "notes_placeholder_agriculture": "अपनी फसल का कुल मूल्य दर्ज करें।",
  "notes_placeholder_rikaz": "उदा., खोजे गए प्राचीन सिक्कों का मूल्य।",
  "notes_description": "जटिल परिदृश्यों के लिए, कृपया विवरण प्रदान करें।",
  "madhab_label": "विचारधारा (मज़हब)",
  "madhab_placeholder": "एक मज़हब चुनें",
  "madhab_description": "नोट: मज़हब का चयन मुख्य रूप से प्रश्नोत्तर में फ़िक़्ही विवरण को प्रभावित करता है। मुख्य गणना नियम मानक हैं।",
  "calculate_button": "ज़कात की गणना करें",
  "market_prices_title": "मुद्रा और बाजार मूल्य",
  "market_prices_description": "सटीक गणना के लिए, अपनी मुद्रा चुनें और सोने/चांदी की कीमतों को वर्तमान बाजार दरों को प्रतिबिंबित करने के लिए अपडेट करें। डिफ़ॉल्ट मान एक अनुमान के रूप में प्रदान किए गए हैं।",
  "currency_label": "मुद्रा",
  "currency_placeholder": "मुद्रा चुनें",
  "gold_price_label": "सोने की कीमत / ग्राम ({{currency}})",
  "silver_price_label": "चांदी की कीमत / ग्राम ({{currency}})",
  "nisab_label": "निसाब",
  "result_title": "आपकी ज़कात देयता",
  "result_due_for": "{{asset}} के लिए देय ज़कात",
  "result_breakdown": "गणना का विवरण",
  "result_placeholder": "आपकी गणना के परिणाम यहां दिखाई देंगे।",
  "export_pdf_button": "पीडीएफ निर्यात करें",
  "share_button": "साझा करें",
  "calculator_disclaimer": "अस्वीकरण: यह एक शैक्षिक उपकरण है और फतवा नहीं है। कृपया जटिल वित्तीय स्थितियों के लिए एक योग्य इस्लामी विद्वान से परामर्श करें।",
  "faq_title": "अक्सर पूछे जाने वाले प्रश्न",
  "faq_q1": "ज़कात क्या है?",
  "faq_a1": "ज़कात उन मुसलमानों के लिए एक अनिवार्य धर्मार्थ योगदान है जो कुछ धन मानदंडों को पूरा करते हैं। यह इस्लाम के पांच स्तंभों में से एक है और इसे पूजा का एक कार्य माना जाता है। 'ज़कात' शब्द का अर्थ 'शुद्ध करना' है, और यह माना जाता है कि ज़कात देने से व्यक्ति की संपत्ति शुद्ध होती है।",
  "faq_q2": "ज़कात कौन देता है?",
  "faq_a2": "ज़कात किसी भी वयस्क, स्वस्थ दिमाग वाले मुसलमान के लिए अनिवार्य है, जो एक निश्चित सीमा से अधिक धन का मालिक है, जिसे निसाब के रूप में जाना जाता है, एक पूरे चंद्र वर्ष (हौल) के लिए। धन उत्पादक या वृद्धि की क्षमता वाला होना चाहिए।",
  "faq_q3": "निसाब क्या है?",
  "faq_a3": "निसाब वह न्यूनतम धन राशि है जिसका एक मुसलमान मालिक होना चाहिए, जिसके बाद उसे ज़कात देना अनिवार्य हो जाता है। यह सीमा पारंपरिक रूप से 85 ग्राम शुद्ध सोने या 595 ग्राम शुद्ध चांदी के मूल्य पर निर्धारित है। सोने और चांदी के बाजार दरों के आधार पर निसाब का मूल्य प्रतिदिन बदलता है। अपनी ज़कात की गणना करते समय आपको एक विश्वसनीय स्थानीय स्रोत से वर्तमान दरों की जांच करनी चाहिए।",
  "faq_q4": "ज़कात के प्रकार क्या हैं?",
  "faq_a4": "ज़कात को मोटे तौर पर दो मुख्य प्रकारों में वर्गीकृत किया गया है: ज़कात अल-माल (धन पर ज़कात) और ज़कात अल-फ़ित्र (रोज़ा तोड़ने की ज़कात)।\n\n1. ज़कात अल-माल (धन पर ज़कात)\nयह वार्षिक ज़कात है जो किसी व्यक्ति की समग्र संपत्ति पर गणना की जाती है जो एक पूरे चंद्र वर्ष के लिए उसके कब्जे में रही है और निसाब सीमा से ऊपर है। ज़कात अल-माल के अधीन संपत्ति के प्रकारों में शामिल हैं:\n\n* व्यक्तिगत संपत्ति: सोना, चांदी, घर पर या बैंक खातों में नकदी, और स्टॉक।\n* व्यावसायिक संपत्ति: व्यापारिक सामान, व्यावसायिक सूची, और लाभ।\n* कृषि उपज (उश्र): फसलों और कटाई पर ज़कात। दर आमतौर पर प्राकृतिक रूप से सिंचित (बारिश से) भूमि के लिए 10% और कृत्रिम साधनों से सिंचित भूमि के लिए 5% है।\n* पशुधन (अन'आम): ऊंट, मवेशी, भेड़ और बकरियों जैसे चराई वाले जानवरों पर ज़कात, प्रत्येक श्रेणी के लिए विशिष्ट निसाब सीमा और दरों के साथ।\n* निकाले गए संसाधन (रिकाज़): खोजे गए खजाने या प्राकृतिक संसाधनों पर ज़कात, आमतौर पर 20% की दर से।\n\n2. ज़कात अल-फ़ित्र (फ़ितराना)\nयह एक धर्मार्थ दान है जो प्रत्येक मुसलमान, आश्रितों सहित, को रमजान के अंत में ईद-उल-फ़ित्र की नमाज़ से पहले देना होता है। यह एक निश्चित राशि (पारंपरिक रूप से एक सा' - लगभग 3 किलो) एक मुख्य खाद्य पदार्थ जैसे खजूर, जौ, या गेहूं, या इसके मौद्रिक समकक्ष का होता है। इसका उद्देश्य उन लोगों को शुद्ध करना है जिन्होंने रोज़ा रखा और यह सुनिश्चित करना है कि गरीब ईद मना सकें।",
  "faq_q5": "विश्वसनीय सुन्नी स्रोतों से संदर्भ",
  "faq_a5": "ज़कात की बाध्यता कुरान और पैगंबर मुहम्मद (सल्लल्लाहु अलैहि व सल्लम) की सुन्नत में स्थापित है।\n\nकुरान: \"और नमाज़ स्थापित करो और ज़कात दो और झुकने वालों के साथ झुको।\" (सूरह अल-बक़रा 2:43)\n\nहदीस: पैगंबर मुहम्मद (सल्लल्लाहु अलैहि व सल्लम) ने कहा, \"इस्लाम पांच [स्तंभों] पर बनाया गया है: यह गवाही देना कि अल्लाह के अलावा कोई ईश्वर नहीं है और मुहम्मद अल्लाह के रसूल हैं, नमाज़ स्थापित करना, ज़कात देना, घर (काबा) का हज करना, और रमजान के रोज़े रखना।\" (सहीह अल-बुखारी, सहीह मुस्लिम)",
  "chatbot_cta": "प्रश्न हैं? हमारे एआई से पूछें!",
  "chatbot_sr_open": "ज़कात एआई सहायक खोलें",
  "chatbot_title": "ज़कात एआई सहायक",
  "chatbot_description": "ज़कात के बारे में कोई भी प्रश्न पूछें और तुरंत उत्तर पाएं।",
  "chatbot_placeholder": "एक प्रश्न पूछें जैसे: \"सोने का निसाब क्या है?\"",
  "chatbot_input_placeholder": "एक प्रश्न पूछें...",
  "chatbot_sr_send": "भेजें"
}
