
{
  "appTitle": "زکوٰۃ کیلکولیٹر",
  "appDescription": "آپ کی زکوٰۃ کی ذمہ داریوں کے لئے ایک ذہین معاون۔",
  "supportTitle": "اس منصوبے کی حمایت کریں",
  "supportDescription": "یہ ایپ مفت، اشتہارات سے پاک، اور امت کے لئے بنائی گئی ہے۔",
  "supportMessage": "ایک انفرادی ڈویلپر کی حیثیت سے، آپ کی حمایت سرور کے اخراجات کو پورا کرنے میں مدد کرتی ہے اور مجھے ہماری کمیونٹی کے لئے اس ٹول کو بہتر بنانے کی اجازت دیتی ہے۔ آپ کا تعاون، چاہے کتنا ہی چھوٹا کیوں نہ ہو، بہت سراہا جاتا ہے۔",
  "donateButton": "BitPay کے ذریعے کریپٹو سے عطیہ کریں",
  "supportNote": "براہ کرم کوڈ میں \"YOUR_BITPAY_ID\" کو اپنے اصل BitPay لنک سے تبدیل کریں۔",
  "footerBuiltWithCare": "مسلم کمیونٹی کے لئے احتیاط سے بنایا گیا ہے۔",
  "footerAllRightsReserved": "جملہ حقوق محفوظ ہیں۔",
  "calculator_title": "زکوٰۃ کیلکولیٹر",
  "calculator_description": "اپنی زکوٰۃ کا حساب لگانے کے لئے اثاثہ کی قسم اور شرائط منتخب کریں۔",
  "asset_type_label": "اثاثہ کی قسم",
  "asset_type_placeholder": "اثاثہ کی قسم منتخب کریں",
  "asset_gold": "سونا",
  "asset_silver": "چاندی",
  "asset_cash": "نقد اور بچت",
  "asset_investments": "سرمایہ کاری",
  "asset_business": "کاروباری اثاثے",
  "asset_livestock": "مویشی",
  "asset_agriculture": "زراعت",
  "asset_rikaz": "رکاز (خزانہ)",
  "livestock_type_label": "مویشی کی قسم",
  "livestock_type_placeholder": "مویشی کی قسم منتخب کریں",
  "livestock_sheep_goats": "بھیڑ/بکری",
  "livestock_cattle": "گائے",
  "livestock_camels": "اونٹ",
  "weight_in_grams_label": "گرام میں وزن",
  "number_of_animals_label": "جانوروں کی تعداد",
  "asset_value_in_currency_label": "{{currency}} میں اثاثہ کی قیمت",
  "hawl_completed_label": "حول (سال) مکمل ہو گیا ہے؟",
  "hawl_description": "کیا آپ نے یہ دولت ایک قمری سال تک اپنے پاس رکھی ہے؟",
  "irrigation_method_label": "آبپاشی کا طریقہ",
  "agri_rain_fed": "بارانی (10%)",
  "agri_artificial": "مصنوعی طور پر سیراب (5%)",
  "notes_label": "اضافی نوٹس (اختیاری)",
  "notes_placeholder_gold": "اپنے سونے کا وزن گرام میں درج کریں۔",
  "notes_placeholder_silver": "اپنی چاندی کا وزن گرام میں درج کریں۔",
  "notes_placeholder_cash": "مثال کے طور پر، بینک کھاتوں اور ہاتھ میں نقد کل رقم۔",
  "notes_placeholder_investments": "مثال کے طور پر، اسٹاک، میوچل فنڈز، وغیرہ کی قیمت۔",
  "notes_placeholder_business": "مثال کے طور پر، انوینٹری کی قیمت + وصولی - قلیل مدتی قرضے۔",
  "notes_placeholder_livestock": "قیمت کے خانے میں جانوروں کی تعداد درج کریں۔",
  "notes_placeholder_agriculture": "اپنی فصل کی کل قیمت درج کریں۔",
  "notes_placeholder_rikaz": "مثال کے طور پر، دریافت شدہ قدیم سکوں کی قیمت۔",
  "notes_description": "پیچیدہ منظرناموں کے لئے، براہ کرم تفصیلات فراہم کریں۔",
  "madhab_label": "مکتبہ فکر (مذہب)",
  "madhab_placeholder": "ایک مذہب منتخب کریں",
  "madhab_description": "نوٹ: مذہب کا انتخاب بنیادی طور پر سوال و جواب میں فقہی تفصیلات کو متاثر کرتا ہے۔ بنیادی حساب کے قواعد معیاری ہیں۔",
  "calculate_button": "زکوٰۃ کا حساب لگائیں",
  "market_prices_title": "کرنسی اور مارکیٹ کی قیمتیں",
  "market_prices_description": "درست حساب کے لئے، اپنی کرنسی منتخب کریں اور سونے/چاندی کی قیمتوں کو موجودہ مارکیٹ کی شرحوں کی عکاسی کرنے کے لئے اپ ڈیٹ کریں۔ پہلے سے طے شدہ اقدار ایک تخمینہ کے طور پر فراہم کی گئی ہیں۔",
  "currency_label": "کرنسی",
  "currency_placeholder": "کرنسی منتخب کریں",
  "gold_price_label": "سونے کی قیمت / گرام ({{currency}})",
  "silver_price_label": "چاندی کی قیمت / گرام ({{currency}})",
  "nisab_label": "نصاب",
  "result_title": "آپ کی زکوٰۃ کی ذمہ داری",
  "result_due_for": "{{asset}} کے لئے قابل ادائیگی زکوٰۃ",
  "result_breakdown": "حساب کی تفصیل",
  "result_placeholder": "آپ کے حساب کے نتائج یہاں ظاہر ہوں گے۔",
  "export_pdf_button": "پی ڈی ایف برآمد کریں",
  "share_button": "شیئر کریں",
  "calculator_disclaimer": "دستبرداری: یہ ایک تعلیمی ٹول ہے اور فتویٰ نہیں ہے۔ براہ کرم پیچیدہ مالی حالات کے لئے ایک مستند اسلامی اسکالر سے مشورہ کریں۔",
  "faq_title": "اکثر پوچھے گئے سوالات",
  "faq_q1": "زکوٰۃ کیا ہے؟",
  "faq_a1": "زکوٰۃ ان مسلمانوں کے لئے ایک لازمی خیراتی حصہ ہے جو کچھ دولت کے معیار پر پورا اترتے ہیں۔ یہ اسلام کے پانچ ستونوں میں سے ایک ہے اور اسے عبادت کا ایک عمل سمجھا جاتا ہے۔ 'زکوٰۃ' کے لفظ کا مطلب 'پاک کرنا' ہے، اور یہ خیال کیا جاتا ہے کہ زکوٰۃ ادا کرنے سے انسان کی دولت پاک ہوتی ہے۔",
  "faq_q2": "زکوٰۃ کون ادا کرتا ہے؟",
  "faq_a2": "زکوٰۃ ہر بالغ، عاقل مسلمان پر فرض ہے جو ایک خاص حد سے زیادہ دولت کا مالک ہو، جسے نصاب کہا جاتا ہے، ایک پورے قمری سال (حول) کے لئے۔ دولت پیداواری یا ترقی کی صلاحیت والی ہونی چاہئے۔",
  "faq_q3": "نصاب کیا ہے؟",
  "faq_a3": "نصاب وہ کم از کم دولت کی مقدار ہے جس کا ایک مسلمان مالک ہونا چاہئے اس سے پہلے کہ اس پر زکوٰۃ واجب ہو۔ یہ حد روایتی طور پر 85 گرام خالص سونے یا 595 گرام خالص چاندی کی قیمت پر مقرر ہے۔ سونے اور چاندی کی مارکیٹ کی شرحوں کی بنیاد پر نصاب کی قیمت روزانہ بدلتی ہے۔ اپنی زکوٰۃ کا حساب لگاتے وقت آپ کو ایک قابل اعتماد مقامی ذریعہ سے موجودہ شرحوں کی جانچ کرنی چاہئے۔",
  "faq_q4": "زکوٰۃ کی اقسام کیا ہیں؟",
  "faq_a4": "زکوٰۃ کو وسیع پیمانے پر دو اہم اقسام میں تقسیم کیا گیا ہے: زکوٰۃ المال (دولت پر زکوٰۃ) اور زکوٰۃ الفطر (روزہ توڑنے کی زکوٰۃ)۔\n\n1. زکوٰۃ المال (دولت پر زکوٰۃ)\nیہ سالانہ زکوٰۃ ہے جو کسی فرد کی مجموعی دولت پر شمار کی جاتی ہے جو ایک پورے قمری سال تک اس کے قبضے میں رہی ہو اور نصاب کی حد سے زیادہ ہو۔ زکوٰۃ المال کے تحت آنے والے اثاثوں کی اقسام میں شامل ہیں:\n\n* ذاتی دولت: سونا، چاندی، گھر میں یا بینک کھاتوں میں نقد رقم، اور اسٹاک۔\n* کاروباری دولت: تجارتی سامان، کاروباری انوینٹری، اور منافع۔\n* زرعی پیداوار (عشر): فصلوں اور کٹائی پر زکوٰۃ۔ شرح عام طور پر قدرتی طور پر سیراب ہونے والی (بارش سے) زمین کے لئے 10٪ اور مصنوعی ذرائع سے سیراب ہونے والی زمین کے لئے 5٪ ہے۔\n* مویشی (انعام): اونٹ، مویشی، بھیڑ اور بکریوں جیسے چرنے والے جانوروں پر زکوٰۃ، ہر قسم کے لئے مخصوص نصاب کی حد اور شرحوں کے ساتھ۔\n* نکالی گئی وسائل (رکاز): دریافت شدہ خزانوں یا قدرتی وسائل پر زکوٰۃ، عام طور پر 20٪ کی شرح سے۔\n\n2. زکوٰۃ الفطر (فطرانہ)\nیہ ایک خیراتی عطیہ ہے جو ہر مسلمان، بشمول زیر کفالت افراد، کو رمضان کے آخر میں عید الفطر کی نماز سے پہلے دینا ہوتا ہے۔ یہ ایک مقررہ رقم (روایتی طور پر ایک صاع - تقریباً 3 کلوگرام) ایک اہم غذائی شے جیسے کھجور، جو، یا گندم، یا اس کے مالی مساوی کا ہوتا ہے۔ اس کا مقصد ان لوگوں کو پاک کرنا ہے جنہوں نے روزہ رکھا اور یہ یقینی بنانا ہے کہ غریب عید منا سکیں۔",
  "faq_q5": "معتبر سنی ذرائع سے حوالہ جات",
  "faq_a5": "زکوٰۃ کی فرضیت قرآن اور نبی محمد صلی اللہ علیہ وسلم کی سنت میں قائم ہے۔\n\nقرآن: \"اور نماز قائم کرو اور زکوٰۃ دو اور رکوع کرنے والوں کے ساتھ رکوع کرو۔\" (سورہ البقرہ 2:43)\n\nحدیث: نبی محمد صلی اللہ علیہ وسلم نے فرمایا، \"اسلام پانچ [ستونوں] پر بنایا گیا ہے: یہ گواہی دینا کہ اللہ کے سوا کوئی معبود نہیں اور محمد اللہ کے رسول ہیں، نماز قائم کرنا، زکوٰۃ دینا، بیت اللہ کا حج کرنا، اور رمضان کے روزے رکھنا۔\" (صحیح البخاری، صحیح مسلم)",
  "chatbot_cta": "سوالات ہیں؟ ہمارے اے آئی سے پوچھیں!",
  "chatbot_sr_open": "زکوٰۃ اے آئی اسسٹنٹ کھولیں",
  "chatbot_title": "زکوٰۃ اے آئی اسسٹント",
  "chatbot_description": "زکوٰۃ کے بارے میں کوئی بھی سوال پوچھیں اور فوری جواب حاصل کریں۔",
  "chatbot_placeholder": "ایک سوال پوچھیں جیسے: \"سونے کا نصاب کیا ہے؟\"",
  "chatbot_input_placeholder": "ایک سوال پوچھیں...",
  "chatbot_sr_send": "بھیجیں"
}
